app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts"
---
  def index
    @accounts = Account.all

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @account = Account.find(params[:id])

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @account = Account.find(params[:id])

SELECT "account_types".* FROM "account_types" WHERE "account_types"."name" = 'Asset' LIMIT 1
INSERT INTO "accounts" ("account_type_id", "amount", "created_at", "name", "project_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["account_type_id", 0], ["amount", 100], ["created_at", Sat, 21 Dec 2013 11:41:00 UTC +00:00], ["name", "Bank"], ["project_id", 0], ["updated_at", Sat, 21 Dec 2013 11:41:00 UTC +00:00]]
---
  def create
    params[:account][:account_type_id]=(AccountType.find_by_name params[:account][:account] ).id
    params[:account].delete :account
    params[:account][:project_id]=session[:project]
    @account=Account.new params[:account]
        respond_to do |format|
      if @account.save

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "accounts" SET "account_type_id" = 0, "project_id" = 1, "updated_at" = '2013-12-21 11:41:51.510906' WHERE "accounts"."id" = 2
---
  def update
    @account = Account.find(params[:id])

    respond_to do |format|
      if @account.update_attributes(params[:account])

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "accounts" WHERE "accounts"."id" = ?  [["id", 1]]
---
  def destroy
    @account = Account.find(params[:id])
    @account.histories.each{|a| a.destroy}