app/controllers/account_types_controller.rb

  def index
    @account_types = AccountType.all.select{|a| can?(:read,a)}
---
SELECT "account_types".* FROM "account_types"

  def create

    like=AccountType.find_by_name params[:account][:like]
    params[:account_type][:credit]=like.credit
    params[:account_type][:debit]=like.debit

    @account_type = AccountType.new(params[:account_type])
    respond_to do |format|
      if @account_type.save
---
INSERT INTO "account_types" ("created_at", "credit", "debit", "name", "sign", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 28 Dec 2013 19:22:01 UTC +00:00], ["credit", nil], ["debit", nil], ["name", "Asset"], ["sign", -1], ["updated_at", Sat, 28 Dec 2013 19:22:01 UTC +00:00]]