app/controllers/projects_controller.rb

  def index
    @projects = Project.all
    @Users=User.all
---
SELECT "projects".* FROM "projects"
SELECT "users".* FROM "users"

  def create
    params[:project][:user_id]=current_user.id
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sat, 21 Dec 2013 11:34:33 UTC +00:00], ["name", "Kiosk"], ["updated_at", Sat, 21 Dec 2013 11:34:33 UTC +00:00], ["user_id", 0]]