app/controllers/transactions_controller.rb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."note" = 'from web' LIMIT 1
SELECT "transactions".* FROM "transactions" WHERE "transactions"."transaction_id" = 39 LIMIT 1
---
  def index
    if params[:note] && !params[:note].empty?
      @transactions =Transaction.find_all_by_note params[:note]
    else
      @transactions = Transaction.all

SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT 1  [["id", "18"]]
---
  def show
    @transaction = Transaction.find(params[:id])

SELECT COUNT("accounts"."name") FROM "accounts"
SELECT name FROM "accounts" LIMIT 1
---
  def new
    @transaction = Transaction.new
    @account=Account.all.collect {|p| p.name }

SELECT "accounts".* FROM "accounts" WHERE "accounts"."name" = 'Capital' LIMIT 1
INSERT INTO "transactions" ("account_id", "amount", "created_at", "note", "transaction_id", "transaction_type", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

  @account=Account.all.collect {|p| p.name }
    created= true
    msg=""
        account_credit=Account.find_by_name params[:credit]
        account_debit=Account.find_by_name params[:debit]
        params[:transaction][:account_id_credit]=account_credit.id
	params[:transaction][:account_id_debit]=account_debit.id
	params[:transaction][:user_id]=current_user.id
        @t=Transaction.new params[:transaction]

      respond_to do |format|
      if @t.save